nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/common/wifi/wifidriver/wpa_supp_if/rtos_wpa_supp_if.c
    ap_params = (nxp_wifi_ap_info_t *)OSA_MemoryAllocate(sizeof(nxp_wifi_ap_info_t));

    if (!ap_params)
    {
        supp_e("%s: ap params calloc failed", __func__);
        goto out;
    }

    ap_params->beacon_set = beacon_set;

    memcpy(ap_params->bssid, params->head + BSSID_OFFSET, WIFI_ETH_ADDR_LEN);

    memcpy(ap_params->head_ie.ie, params->head, params->head_len);

    ap_params->head_ie.ie_len = params->head_len;

    memcpy(ap_params->tail_ie.ie, params->tail, params->tail_len);

    ap_params->tail_ie.ie_len = params->tail_len;

    ap_params->dtim_period = params->dtim_period;

    ap_params->beacon_int = params->beacon_int;

    if (params->proberesp && params->proberesp_len)
    {
        memcpy(ap_params->proberesp.ie, params->proberesp, params->proberesp_len);

        ap_params->proberesp_ies.ie_len = params->proberesp_len;
    }

    if (params->ssid && params->ssid_len)
    {
        memcpy((void *)ap_params->ssid.ssid, (const void *)params->ssid, (size_t)params->ssid_len);

        ap_params->ssid.ssid_len = params->ssid_len;
    }

    ap_params->hide_ssid = params->hide_ssid;

    ap_params->pairwise_ciphers = params->pairwise_ciphers;
    ap_params->group_cipher     = params->group_cipher;
    ap_params->key_mgmt_suites  = params->key_mgmt_suites;
    ap_params->auth_algs        = params->auth_algs;
    ap_params->wpa_version      = params->wpa_version;
    ap_params->privacy          = params->privacy;

    if (params->beacon_ies)
    {
        memcpy(ap_params->beacon_ies.ie, params->beacon_ies->buf, params->beacon_ies->used);

        ap_params->beacon_ies.ie_len = params->beacon_ies->used;
    }

    if (params->proberesp_ies)
    {
        memcpy(ap_params->proberesp_ies.ie, params->proberesp_ies->buf, params->proberesp_ies->used);

        ap_params->proberesp_ies.ie_len = params->proberesp_ies->used;
    }

    if (params->assocresp_ies)
    {
        memcpy(ap_params->assocresp_ies.ie, params->assocresp_ies->buf, params->assocresp_ies->used);

        ap_params->assocresp_ies.ie_len = params->assocresp_ies->used;
    }

    ap_params->ht_opmode         = params->ht_opmode;
    ap_params->ap_max_inactivity = params->ap_max_inactivity;
    ap_params->reenable          = params->reenable;
    ap_params->twt_responder     = params->twt_responder;
    ap_params->sae_pwe           = params->sae_pwe;

    if (params->freq)
    {
        ap_params->chan.mode               = (enum wifi_mode)params->freq->mode;
        ap_params->chan.freq               = params->freq->freq;
        ap_params->chan.channel            = params->freq->channel;
        ap_params->chan.sec_channel_offset = params->freq->sec_channel_offset;
        ap_params->chan.bandwidth          = params->freq->bandwidth;
        ap_params->chan.ht_enabled         = params->freq->ht_enabled;
        ap_params->chan.vht_enabled        = params->freq->vht_enabled;
        ap_params->chan.he_enabled         = params->freq->he_enabled;
        ap_params->chan.center_freq1       = params->freq->center_freq1;
        ap_params->chan.center_freq2       = params->freq->center_freq2;
    }

    status = wifi_nxp_beacon_config(ap_params);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp beacon config failed", __func__);
        goto out;
    }

    if (!beacon_set)
    {
        wifi_if_ctx_rtos->uap_started = true;
    }

    ret = 0;
out:
    if (ap_params != NULL)
    {
        OSA_MemoryFree((void *)ap_params);
    }
    return ret;
}

int wifi_nxp_hostapd_sta_add(void *if_priv, struct hostapd_sta_add_params *params)
{
    int status                      = -WM_FAIL;
    nxp_wifi_sta_info_t *sta_params = NULL;

    if ((!if_priv) || (!params))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    sta_params = (nxp_wifi_sta_info_t *)OSA_MemoryAllocate(sizeof(nxp_wifi_sta_info_t));

    if (!sta_params)
    {
        supp_e("%s: sta params calloc failed", __func__);
        goto out;
    }

    sta_params->set = params->set;

    memcpy(sta_params->addr, params->addr, WIFI_ETH_ADDR_LEN);

    sta_params->aid = params->aid;

    sta_params->capability = params->capability;

    if (params->supp_rates_len)
    {
        sta_params->supp_rates_len = params->supp_rates_len;
        memcpy((void *)sta_params->supp_rates, (const void *)params->supp_rates, (size_t)sta_params->supp_rates_len);
    }

    sta_params->listen_interval = params->listen_interval;

    if (params->ext_capab)
    {
        memcpy(sta_params->ext_capab, params->ext_capab, params->ext_capab_len);
        sta_params->ext_capab_len = params->ext_capab_len;
    }

    sta_params->qosinfo = params->qosinfo;

    if (params->flags & WPA_STA_AUTHORIZED)
        sta_params->flags |= STA_FLAG_AUTHORIZED;

    if (params->flags & WPA_STA_WMM)
        sta_params->flags |= STA_FLAG_WME;

    if (params->flags & WPA_STA_SHORT_PREAMBLE)
        sta_params->flags |= STA_FLAG_SHORT_PREAMBLE;

    if (params->flags & WPA_STA_MFP)
        sta_params->flags |= STA_FLAG_MFP;

    if (params->flags & WPA_STA_AUTHENTICATED)
        sta_params->flags |= STA_FLAG_AUTHENTICATED;

    if (params->flags & WPA_STA_ASSOCIATED)
        sta_params->flags |= STA_FLAG_ASSOCIATED;

    if (params->ht_capabilities)
    {
        memcpy(&sta_params->ht_capab, params->ht_capabilities, sizeof(struct ieee80211_ht_capabilities));
        sta_params->ht_capab_len = sizeof(struct ieee80211_ht_capabilities);
    }

    if (params->vht_capabilities)
    {
        memcpy(&sta_params->vht_capab, params->vht_capabilities, sizeof(struct ieee80211_vht_capabilities));
        sta_params->vht_capab_len = sizeof(struct ieee80211_vht_capabilities);
    }

    if (params->he_capab)
    {
        memcpy(&sta_params->he_capab, params->he_capab, sizeof(struct ieee80211_he_capabilities));
        sta_params->he_capab_len = params->he_capab_len;
    }

    status = wifi_nxp_sta_add(sta_params);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp sta add failed", __func__);
    }
out:
    if (sta_params != NULL)
    {
        OSA_MemoryFree((void *)sta_params);
    }
    return status;
}

int wifi_nxp_hostapd_sta_remove(void *if_priv, const u8 *addr)
{
    int status = -WM_FAIL;

    if ((!if_priv) || (!addr))
    {
        supp_e("%s: Invalid params", __func__);
        goto out;
    }

    status = wifi_nxp_sta_remove(addr);
    if (status != WM_SUCCESS)
    {
        supp_e("%s: wifi nxp sta remove failed", __func__);
    }
out:
    return status;
}

